In [1]:
import numpy as np
import pandas as pd
%matplotlib inline

In [12]:
# Set up data
# Greg was 14, Marcia was 12, Peter was 11, Jan was 10, 
# Bobby was 8, and Cindy was 6 when they started playing the Brady kids on The Brady Bunch. 
# Cousin Oliver was 8 years old when he joined the show



Brady = pd.DataFrame()
Brady['Name'] = ['Greg', 'Marcia', 'Peter', 'Jan', 'Bobby', 'Cindy', 'Oliver']
Brady['Age'] = (14, 12, 11, 10, 8, 6, 8)
Brady.head(7)

     Name  Age
0    Greg   14
1  Marcia   12
2   Peter   11
3     Jan   10
4   Bobby    8
5   Cindy    6
6  Oliver    8

In [13]:
#What are the mean, median, and mode of the kids' ages when they first appeared on the show? 
#What are the variance, standard deviation, and standard error?
Brady.describe()

             Age
count   7.000000
mean    9.857143
std     2.734262
min     6.000000
25%     8.000000
50%    10.000000
75%    11.500000
max    14.000000

In [11]:
Brady.mode()

     Name  Age
0   Bobby  8.0
1   Cindy  NaN
2    Greg  NaN
3     Jan  NaN
4  Marcia  NaN
5  Oliver  NaN
6   Peter  NaN

In [14]:
Brady.median()

Age    10.0
dtype: float64

In [15]:
Brady.var()

Age    7.47619
dtype: float64

In [16]:
np.std(Brady['Age'] ,ddof=1) / np.sqrt(len(Brady['Age']))

1.0334540197243192

In [24]:
#Only meaningful stat is mean, STD and SE are meaningless due to sample size(small)
#Median and mode are only a curiousity, VAR is the next interesting stat.

#Next, Cindy has a birthday. Update your estimates- what changed, and what didn't?


del(Age)[5]
Brady.head(7)

NameError: name 'Age' is not defined

In [27]:
cindybd = pd.DataFrame()
cindybd['Name'] = ['Greg', 'Marcia', 'Peter', 'Jan', 'Bobby', 'Cindy', 'Oliver']
cindybd['Age'] = (14, 12, 11, 10, 8, 7, 8)
cindybd.head(7)

     Name  Age
0    Greg   14
1  Marcia   12
2   Peter   11
3     Jan   10
4   Bobby    8
5   Cindy    7
6  Oliver    8

In [28]:
cindybd.describe()

             Age
count   7.000000
mean   10.000000
std     2.516611
min     7.000000
25%     8.000000
50%    10.000000
75%    11.500000
max    14.000000

In [31]:
# 	Age
#count 	7.000000    NC
#mean 	9.857143    C
#std 	2.734262    C
#min 	6.000000    C
#25% 	8.000000    NC
#50% 	10.000000   NC
#75% 	11.500000   NC
#max 	14.00000   NC


cindybd.mode()

     Name  Age
0   Bobby  8.0
1   Cindy  NaN
2    Greg  NaN
3     Jan  NaN
4  Marcia  NaN
5  Oliver  NaN
6   Peter  NaN

In [32]:
cindybd.median()

Age    10.0
dtype: float64

In [33]:
cindybd.var()

Age    6.333333
dtype: float64

In [34]:
np.std(cindybd['Age'] ,ddof=1) / np.sqrt(len(cindybd['Age']))

0.9511897312113418

In [35]:
#Nobody likes Cousin Oliver. Maybe the network should have used an even younger actor. 
#Replace Cousin Oliver with 1-year-old Jessica, then recalculate again. 
#Does this change your choice of central tendency or variance estimation methods?

deadco = pd.DataFrame()
deadco['Name'] = ['Greg', 'Marcia', 'Peter', 'Jan', 'Bobby', 'Cindy', 'Jessica']
deadco['Age'] = (14, 12, 11, 10, 8, 6, 1)
deadco.head(7)

      Name  Age
0     Greg   14
1   Marcia   12
2    Peter   11
3      Jan   10
4    Bobby    8
5    Cindy    6
6  Jessica    1

In [36]:
deadco.describe()

             Age
count   7.000000
mean    8.857143
std     4.336995
min     1.000000
25%     7.000000
50%    10.000000
75%    11.500000
max    14.000000

In [37]:
# No change in MEDIAN

deadco.median()

Age    10.0
dtype: float64

In [38]:
# Big change in VAR

deadco.var()

Age    18.809524
dtype: float64

In [39]:
# On the 50th anniversary of The Brady Bunch, 
# four different magazines asked their readers whether they were fans of the show. 
# The answers were: TV Guide 20% fans Entertainment Weekly 23% fans Pop Culture Today 17% fans SciPhi Phanatic 5% fans

# Based on these numbers, what percentage of adult Americans would you estimate were Brady Bunch fans on the 50th anniversary of the show?



brady_fans = pd.DataFrame()
brady_fans['Magazine'] = ['TVG', 'EW', 'PCT', 'SPP']
brady_fans['%_fan'] = (20, 23, 17, 5)
brady_fans.head()

  Magazine  %_fan
0      TVG     20
1       EW     23
2      PCT     17
3      SPP      5

In [41]:
brady_fans.describe()

           %_fan
count   4.000000
mean   16.250000
std     7.889867
min     5.000000
25%    14.000000
50%    18.500000
75%    20.750000
max    23.000000

In [42]:
brady_fans.median()

%_fan    18.5
dtype: float64

In [43]:
brady_fans.var()

%_fan    62.25
dtype: float64

In [44]:
np.std(brady_fans['%_fan'] ,ddof=1) / np.sqrt(len(brady_fans['%_fan']))

3.944933459514875

In [ ]:
# With such a poor sample size and not even having the number of subscribers of each Magazine.  
# I would estimate the Adult American Fan Base of The Brady Bunch to 16.25% +/- 3.9%